app/views/readers/_reader_form.html.erb

		<%= f.label :fav_book %>
		<%= f.collection_select :fav_book, Book.all, :id, :title %>
---
SELECT "books".* FROM "books"

		<%= f.label :fav_author %>
		<%= f.collection_select	:fav_author, Author.all, :id, :name %>
---
SELECT "authors".* FROM "authors"