app/views/readers/index.html.erb

SELECT "readers".* FROM "readers"
---
<br>
<%= button_to "Random Reader", reader_path(Reader.all.sample), method: "get" %>