app/views/readers/show.html.erb

SELECT "books".* FROM "books"
---
			<%= f.label :book_id, "Book" %>
			<%= f.collection_select :book_id, Book.all, :id, :title %>

SELECT "goals".* FROM "goals" WHERE "goals"."reader_id" = ?  [["reader_id", 50]]
SELECT 1 AS one FROM "goals" WHERE "goals"."reader_id" = ? LIMIT ?  [["reader_id", 51], ["LIMIT", 1]]
---

<% if @reader.goals.any? %>

SELECT "goals".* FROM "goals" WHERE "goals"."reader_id" = ?  [["reader_id", 51]]
---
		<tbody>
			<%@reader.goals.each do |goal| %>