app/views/readers/show.html.erb

SELECT 1 AS one FROM "goals" WHERE "goals"."reader_id" = ? LIMIT ?  [["reader_id", 50], ["LIMIT", 1]]
---

<% if @reader.goals.any? %>