app/views/authors/index.html.erb

SELECT "authors".* FROM "authors"
---
						<% end %>
						<div class="container has-text-centered"><%= button_to "Random Author", author_path(Author.all.sample), method: "get", class: "button" %></div>