app/views/authors/show.html.erb

<ul>
	<% @author.books.each do |book| %>
---
SELECT "books".* FROM "books" WHERE "books"."author_id" = ?  [["author_id", 4]]