app/views/books/index.html.erb

<br>
<%= button_to "Random Book", book_path(Book.all.sample.id), method: "get" %>
---
SELECT "books".* FROM "books"