app/views/books/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 38]]
SELECT 1 AS one FROM "reviews" WHERE "reviews"."book_id" = ? LIMIT ?  [["book_id", 120], ["LIMIT", 1]]
---

<% if @book.reviews.any? %>

SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 38]]
---

	<% @book.reviews.reverse.each do |review| %>