app/controllers/application_controller.rb

SELECT "readers".* FROM "readers" WHERE "readers"."username" = ? LIMIT ?  [["username", "sara"], ["LIMIT", 1]]
---
	def session_user
		Reader.find_by(username: session[:username]) #unless !session[:username]