app/controllers/authors_controller.rb

	def index
		if Author.search(params[:search]) == []
---
SELECT "authors".* FROM "authors"

		def find_author
			@author = Author.find(params[:id])
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 49], ["LIMIT", 1]]