app/controllers/books_controller.rb

	def create


		if params[:search] != ''
			results = GoogleBooks.search("in#{params[:type]}:#{params[:search]}", {:count => 5})
			@books = Book.create_books_from_google(results)
---
INSERT INTO "books" ("title", "description", "page_count", "author_id", "img", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

		def find_book
			@book = Book.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 120], ["LIMIT", 1]]