app/controllers/goals_controller.rb

	def create
		@goal = Goal.create(goals_params)
---
INSERT INTO "goals" ("reader_id", "book_id", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["reader_id", 15], ["book_id", 15], ["status", 1], ["created_at", "2019-12-03 21:10:45.580239"], ["updated_at", "2019-12-03 21:10:45.580239"]]

	def update_status
		# byebug
		@goal = Goal.find(params[:id])
		@goal.toggle!(:status)
---
SELECT "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "goals" SET "status" = ?, "updated_at" = ? WHERE "goals"."id" = ?  [["status", 1], ["updated_at", "2019-12-04 14:46:48.199166"], ["id", 5]]

	def destroy
		@goal = Goal.find(params[:id])
		reader = @goal.reader
		@goal.destroy
---
SELECT "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "goals" WHERE "goals"."id" = ?  [["id", 6]]