app/controllers/readers_controller.rb

SELECT "readers".* FROM "readers" WHERE "readers"."username" = ? LIMIT ?  [["username", "Trevor"], ["LIMIT", 1]]
---
	def index
		if Reader.search(params[:search]) == []
			flash[:error] = "No Results Found"
			@readers = Reader.all.sort_by {|reader| reader.username}