app/controllers/readers_controller.rb

	def index
		@readers = Reader.all
---
SELECT "readers".* FROM "readers"

	def create
		@reader = Reader.new(reader_params)

		if @reader.save
---
INSERT INTO "readers" ("name", "bio", "age", "fav_book", "username", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "new reader"], ["bio", "I'm a person"], ["age", 16], ["fav_book", 16], ["username", "new"], ["created_at", "2019-12-03 21:22:02.065478"], ["updated_at", "2019-12-03 21:22:02.065478"]]

	def update
		@reader.update(reader_params)
---
UPDATE "readers" SET "bio" = ?, "age" = ?, "username" = ?, "updated_at" = ? WHERE "readers"."id" = ?  [["bio", "Test Bio 2"], ["age", 36], ["username", "reader1234"], ["updated_at", "2019-12-02 22:14:38.926120"], ["id", 13]]

	def destroy
		@reader.destroy
---
DELETE FROM "readers" WHERE "readers"."id" = ?  [["id", 49]]

		def find_reader
			@reader = Reader.find(params[:id])
---
SELECT "readers".* FROM "readers" WHERE "readers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]