app/controllers/reviews_controller.rb

	def create

		@review = Review.new(review_params)

		if @review.save
			redirect_to book_path(@review.book)
		else
			@book = Book.find(@review.book_id)
---
INSERT INTO "reviews" ("goal_id", "book_id", "content", "rating", "recommend", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["goal_id", 47], ["book_id", 36], ["content", "This is a review"], ["rating", 2], ["recommend", 1], ["created_at", "2019-12-05 16:36:50.450197"], ["updated_at", "2019-12-05 16:36:50.450197"]]
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 60], ["LIMIT", 1]]