app/controllers/sessions_controller.rb

SELECT "readers".* FROM "readers" WHERE "readers"."username" = ? LIMIT ?  [["username", "qwertyj"], ["LIMIT", 1]]
---
	def create
		username = params[:username]
		reader = Reader.find_by(username: username)