app/models/book.rb

  def self.create_books_from_google(results)
  	@googlebooks = []
  	results.each do |book|
	  	#authors = book.authors != '' ? book.authors : "Anonymous"

      new_book = Book.find_by(title: book.title)

      if !new_book && book.authors != ''

    		new_book = Book.create(
  	  		title: book.title,
  	  		author: Author.find_or_create_by(name: book.authors),
  	  		description: book.description,
  	  		category: book.categories,
  	  		page_count: book.page_count,
  	  		img: book.image_link
    		)
  		# fix later
  		  new_book.author.bio = Faker::Lorem.paragraphs(number: 7).join
  		  new_book.author.save
---
INSERT INTO "books" ("title", "description", "page_count", "author_id", "img", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT "books".* FROM "books" WHERE "books"."title" = ? AND "books"."author_id" = ? AND "books"."description" IS NULL AND "books"."category" = ? AND "books"."page_count" = ? AND "books"."img" = ? LIMIT ?
INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Stephen Jay Gould"], ["created_at", "2019-12-05 14:44:03.352656"], ["updated_at", "2019-12-05 14:44:03.352656"]]
SELECT "authors".* FROM "authors" WHERE "authors"."name" = ? LIMIT ?  [["name", "Stephen Jay Gould"], ["LIMIT", 1]]
UPDATE "authors" SET "bio" = ?, "updated_at" = ? WHERE "authors"."id" = ?

  def times_read
    self.goals.where("status = true").count
---
SELECT COUNT(*) FROM "goals" WHERE "goals"."book_id" = ? AND (status = true)  [["book_id", 120]]

  def times_on_lists
    self.goals.count
---
SELECT COUNT(*) FROM "goals" WHERE "goals"."book_id" = ?  [["book_id", 120]]

  def number_of_favorites
    Reader.all.where("fav_book = ?", self.id).count
---
SELECT COUNT(*) FROM "readers" WHERE (fav_book = 120)