app/models/reader.rb

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 35], ["LIMIT", 1]]
---
	def display_fav_book_by_id
		if self.fav_book
			book = Book.find(self.fav_book)

SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 43], ["LIMIT", 1]]
---
	def display_fav_author_by_id
		if self.fav_author
			author = Author.find(self.fav_author)

SELECT "goals".* FROM "goals" WHERE "goals"."reader_id" = ? AND "goals"."book_id" = ? LIMIT ?  [["reader_id", 51], ["book_id", 33], ["LIMIT", 1]]
---
	def goal_by_book(book)
		self.goals.find_by(book_id: book.id)

SELECT "goals".* FROM "goals" WHERE "goals"."reader_id" = ?  [["reader_id", 50]]
---
	def read
		self.goals.where("status = true")

SELECT "goals".* FROM "goals" WHERE "goals"."reader_id" = ? AND (status = true)  [["reader_id", 50]]
---
	def unread
		self.goals.where("status = false")

SELECT COUNT(*) FROM "reviews" INNER JOIN "goals" ON "reviews"."goal_id" = "goals"."id" WHERE "goals"."reader_id" = ?  [["reader_id", 50]]
---
	def number_reviews
		self.reviews.count

SELECT "reviews".* FROM "reviews" INNER JOIN "goals" ON "reviews"."goal_id" = "goals"."id" WHERE "goals"."reader_id" = ?  [["reader_id", 50]]
---
	def average_review_length
		total = self.reviews.sum do |review|