app/models/reader.rb

	def display_fav_book_by_id
		if self.fav_book
			book = Book.find(self.fav_book)
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]

	def display_fav_author_by_id
		if self.fav_author
			author = Author.find(self.fav_author)
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]