app/views/layouts/application.html.erb

SELECT "readers".* FROM "readers" WHERE "readers"."username" = ? LIMIT ?  [["username", "Trevor"], ["LIMIT", 1]]
---
      <% if session[:username] %>
        <%= link_to "#{session[:username]}'s' Profile", reader_path(Reader.find_by(username: session[:username])) %> /